PRICE_MOUTH = 99
PRICE_MOUTH_ND = 149
ADMINCHAT = 474425142
COUNT_PAGE = 6
PSK = 'Dchu963TXUeX3G3jiZAT'
SERVER_USA = '80.209.243.179'
SERVER_NID = '147.45.137.150'
URL_KEY_COMMAND = "https://www.icloud.com/shortcuts/c9d7529d50fe4d6eb50c67fe1e89d299"
API_URL = "https://80.209.243.179:43729/U_qDTxuWdvDXiT6w2vAFlg"
API_URL_NIDERLAND = "https://147.45.137.150:38844/hvinb7PFielq3P4XxkH6dA"
FILE_URL = "/root/bot_vpn/"
FIRST_START_DURATION = 48
WALLET_API_KEY = '5jXwhrJBdBi9xNCocgyQCI54FgvrPgJqcwrU'



#text message
TEXTPAYUSAMARKDOWNV2 = str("Оплатить подписку можно 3мя способами\.\n" +
                        "\n*Для оплаты рублями необходимо совершить перевод на карту сбербанк по номеру:\n`4276380227057465`\n" +
                        "\n*и прислать чек оплаты сюда в чат, можно скриншотом или чек, после чего администратор проверит и выдаст вам доступ к быстрому и безопасному VPN\." +
                        "\nстоимость подписки за 30 дней " + str(PRICE_MOUTH) + " руб\. " +
                        "Вы можете оплатить от 30\(примерно месяц\) до 360\(примерно год\) дней подписки сразу, просто расчтайте сумму и отправляйте\.\n" +
                        "\n Доступна подписка/оплата через сервис [boosty](https://boosty.to/openvpn_bot) если у вас есть аккаунт \n" +
                        "\n_Дешевле оплачивать криптовалютой по кнопке ниже.")

TEXTPAY = str("Доступно 2 тарифа."+
                        "\n\n" +
                        "США - наш базовый тариф, который зарекомендовал себя как лучшее предложение на рынке свободного интернета, по максимально доступной цене." +
                        "\n" +
                        "Тариф также можно рассматривать как рабочий инструмент для дропшивтеров, заказывающих товар из США." +
                        "\n" +
                        "Цена: " + str(PRICE_MOUTH) +
                        "\n\n" +
                        "Нидерланды - новый продвинутый тариф, с более высокой скоростью работы." +
                        "\n"+
                        "Сервера данного тарифа более свободны, находятся ближе к странам СНГ, имеют более производительное железо, а пропускная способность сети выше." +
                        "\n" +
                        "Эти факторы сделаю ваше путешествие в интернете еще более приятным." +
                        "\nЦена: " + str(PRICE_MOUTH_ND))